import { Random } from 'mockjs'

Random.extend({
  philosopher: function () {
    const arr = [
      '奥古斯丁',
      '奥卡姆',
      '剃刀手柏拉图',
      '边沁',
      '程颢',
      '程颐',
      '但丁',
      '费尔巴哈',
      '弗兰西斯·培根',
      '韩非',
      '黑格尔',
      '黄宗羲',
      '霍布斯',
      '康德',
      '孔子',
      '老子',
      '卢梭',
      '罗素',
      '洛克',
      '马丁·路德',
      '马基雅维利',
      '马克思',
      '孟德斯鸠',
      '孟子',
      '商鞅',
      '叔本华',
      '苏格拉底',
      '知行合一王阳明',
      '西塞罗',
      '休谟',
      '荀子',
      '亚里士多德',
      '张泽杰',
      '朱熹',
      '庄子'
    ]
    return this.pick(arr)
  }
})
